let checkList = [{
    "title": "1978年，中国印钞造币总公司正式亮相",
    "content": "1978年1月1日，总行恢复中国人民银行印制管理局。此后，先后更名为中国人民银行印制总公司、中国印钞造币总公司。现在，中国印钞造币总公司已成长为下辖23家企业和一个国家级技术中心的法定货币生产企业。"
  }, {
    "title": "1979年，我国发行第一套现代纪念金币",
    "content": "1979年10月，国务院批准中国人民银行发行“中华人民共和国成立30周年纪念金币”，该套金币为我国发行的第一套现代纪念金币。"
  }, {
    "title": "1982年，中国钱币学会成立大会在北京召开",
    "content": "1982年6月26日-7月1日，中国钱币学会成立大会在北京召开，选举产生第一届理事会，中国人民银行行长李葆华任名誉理事长，副行长耿道明任理事长，著名经济学家千家驹、国家文物局副局长齐光、印制局局长杨秉超任副理事长并兼任秘书长。从此开启了中国钱币文化保护及研究的新时代。"
  }, {
    "title": "1983年，《中华人民共和国金银管理条例》颁布实施",
    "content": "该条例明确金银的主管机关为中国人民银行。中国人民银行负责管理国家金银储备；负责金银的收购并配售；会同国家物价主管机关制定和管理金银收购与配售价格；负责管理和检查金银市场。于1983年6月15日颁布。"
  }, {
    "title": "1984年，首次发行普通纪念币",
    "content": "为庆祝中华人民共和国成立三十五周年，中国人民银行决定自1984年10月1日起限量发行三种面值为一元的金属纪念币，掀开了普通纪念币发行的序幕。"
  }, {
    "title": "1984年，首设代理发行库",
    "content": "1984年，上海市在全国首创代理人民币发行库管理模式。多年来，代理库在确保现金供应、调节货币流通、提高流通中人民币整洁度等方面发挥了重要作用，有效解决了人民银行货币发行业务资源不足与业务需求快速增长的矛盾。"
  }, {
    "title": "1984年，人民银行确立四级发行库管理体系",
    "content": "1984年10月8日，总行颁布《中国人民银行关于改革发行库业务的若干规定》，确定在总行、省（自治区、直辖市）分行、地（市）分行、县支行设立总库、分库、中心支库、支库，首次建立垂直管理的四级发行库管理体系。"
  }, {
    "title": "1987年起，在全国陆续发行1980年版第四套人民币",
    "content": "为适应经济发展需要，方便流通使用和核算，国务院颁布发行新版人民币命令，责成中国人民银行1987年4月27日起陆续发行一套新版人民币，主币有1元、2元、5元、10元、50元和100元六种；辅币有1角、2角、5角三种。"
  }, {
    "title": "1987年，中国金币总公司成立",
    "content": "1987年8月7日，中国人民银行党组决定成立中国金币总公司。中国金币总公司是中国唯一的专营金银纪念币的行业性公司。"
  }, {
    "title": "1992年，在上海等5省市开展小面额货币单一投放硬币试点",
    "content": "上海、辽宁、江苏、浙江、安徽五省市成为全国首批小面额货币单一投放硬币地区。"
  }, {
    "title": "1992年，中国钱币博物馆建成开馆",
    "content": "1992年7月29日，中国钱币博物馆建成开馆，中国人民银行副行长郭振乾、童赠银和文化部副部长高占祥应邀出席开馆仪式并剪彩。中国钱币博物馆的建立，标志中国的钱币事业迈上了一个新的台阶。"
  }, {
    "title": "1993年，《中华人民共和国国家货币出入境管理办法》颁布",
    "content": "为加强国家货币出入境管理，维护国家金融秩序，适应改革开放的要求，人民银行制定了《中华人民共和国国家货币出入境管理办法》，对个人携带人民币出入境实施管理。1993年1月20日，国务院第108号令公布。"
  }, {
    "title": "1994年，国务院反假货币工作联席会议成立",
    "content": "1994年9月30日，经国务院同意，决定成立“国务院反假货币工作联席会议”，会议由人民银行党组书记周正庆为召集人，办事机构设在人民银行。"
  }, {
    "title": "1997年，第一个货币发行业务处理系统上线运行",
    "content": "1997年7月9日起，在全国试运行货币发行管理信息系统，并从1997年10月1日起正式使用。货币发行管理信息系统的上线运行，加快了货币发行业务电子化进程，提高了货币发行工作管理水平，保证了货币发行决策的及时性和准确性。"
  }, {
    "title": "1999年起，陆续发行第五套人民币",
    "content": "为适应经济发展的需要，提高人民币的防伪性能，国务院发布发行第五套人民币的命令，自1999年10月1日起，陆续发行第五套人民币。第五套人民币有100元、50元、20元、10元、5元、1元、5角和1角八种面额。"
  }, {
    "title": "1999年，人民银行发行第一张纪念钞",
    "content": "1999年9月20日，“庆祝中华人民共和国成立五十周年纪念钞”发行，面额为50元，发行数量为6000万张，主色调为红色，正面主景为开国大典盛况组合图景，背面为地球、和平鸽、铜狮、华表等组合图景。"
  }, {
    "title": "1999年，中国人民银行开始组建钞票处理中心",
    "content": "1999年12月28日，总行印发了《关于组建钞票处理中心的意见》，提出了组建钞票处理中心的条件，钞票处理中心的主要任务，钞票处理中心的管理等要求。此后，各分支机构钞票处理中心陆续建立。钞票处理中心的建立，有利于提高钞票处理工作专业化水平，更好地履行中央银行货币发行职能。"
  }, {
    "title": "2000年，《中华人民共和国人民币管理条例》施行",
    "content": "该条例是建国50年来第一部全面、系统规范人民币管理的专门法规，是我国金融经济法制建设的重要成果，是我国货币制度建设的里程碑。条例于2000年5月1日起实施，标志着人民币管理全面进入法制化的新阶段。"
  }, {
    "title": "2000年，发行塑料基材纪念钞",
    "content": "为迎接新世纪、新千年的到来，人民银行于2000年11月28日发行迎接新世纪纪念钞。该纪念钞是我国首次发行塑料基材的纪念钞，面额为100元，发行数量为1000万张。"
  }, {
    "title": "2002年，黄金管理体制改革，上海黄金交易成立",
    "content": "为全面深化黄金管理体制改革，取消“统收统配”管理体制，人民银行报经国务院同意组建上海黄金交易所。上海黄金交易是我国进行市场化管理的重要标志，是促进黄金市场健康发展的重要举措，该所于2002年10月30正式挂牌运行，是国内唯一的专门从事黄金交易的国家级市场。"
  }, {
    "title": "2005年，中国人民银行调整国家货币出入境限额",
    "content": "根据我国经济发展和对外往来实际需要，2005年1月1日，中国人民银行调整国家货币出入境限额。中国公民出入境、外国人入出境每人每次携带的人民币限额由原来的6000元调整为20000元。"
  }, {
    "title": "2005年，中国人民银行发行2005年版第五套人民币",
    "content": "人民银行发布公告，决定于2005年8月31日，发行2005年版第五套人民币100元、50元、20元、10元、5元纸币和1角硬币，丰富了我国流通人民币券别。"
  }, {
    "title": "2007年，中银香港代保管库正式启用",
    "content": "2007年12月13日，深圳分库中银香港代保管库正式启用。该库是我国首个也是目前全球唯一的境外人民币现钞代保管库，已成为境外人民币现钞供应和回流的枢纽。"
  }, {
    "title": "2008年，发行第一张奥运纪念钞",
    "content": "2018年，中国人民银行发行北京夏季奥运会纪念钞，是奥运史上第一张纪念钞，国际奥委会于奥运博物馆中收藏。"
  },
  {
    "title": "2009年，在全国开展打击假币犯罪“09行动”",
    "content": "根据胡锦涛主席和温家宝总理等党和国家领导的重要批示，2009年1月20日起，人民银行和公安部联合在全国开展为期10个的代号“09行动”的打击假币犯罪专项整治行动。该行动是建国以来历时时间最长、打击力度最大、成果最为丰富的一次反假币专项行动，全国假币年收缴量创历史新高。"
  }, {
    "title": "2010年，货币金银局计划调拨处获“上海世博会先进集体”称号",
    "content": "在世博会中，因提供优质的金融服务，向世界展示中国良好的金融基础服务水平，2010年12月货币金银局计划调拨处被党中央、国务院授予“上海世博会先进集体”称号。"
  }, {
    "title": "2011年，中国印钞造币诸多技术赢得国家级荣誉",
    "content": "2011年1月，“SD凹印对印技术”荣获2010年度国家技术发明一等奖。该技术标志着中国在国际印钞专用设备设计制造领域由引进、模仿步入自主创新。在防伪领域，中国印钞造币行业自主开发的最新防伪技术——ColorDance,荣获国际全息技术创新大奖。"
  }, {
    "title": "2011年，北京全自动立体库和钞票处理中心启用",
    "content": "2011年9月，北京立体库和钞票处理中心投入使用，是目前国际上规模最大、自动化程度最高的发行库和钞票处理中心，是我国货币发行现代化、自动化的重要标志和国际交流的重要窗口。"
  }, {
    "title": "2012年，反假货币工作首次列入社会治安综合治理工作考核评比范围",
    "content": "2012年2月13日，中央社会管理综合治理委员会办公室印发《2011年省、自治区、直辖市社会治安综合治理工作考核评比实施细则》（中央综治办【2012】12号】），首次将反假货币工作列入考核评比范围。"
  }, {
    "title": "2013年，第二代货币发行库管理系统在江苏省淮安市启动试点工作",
    "content": "为推动第二代货币发行管理系统研发工作顺利进行，2013年5月28日在南京分行辖内淮安市中心支行首先启动二代货发发行库管理系统试点工作，采取逐步叠加业务种类、试点业务与现行业务并行操作的方式。通过试点工作，系统和物流设备不断得以改进和完善。"
  }, {
    "title": "2014年，中国人民银行首次开展普通纪念币预约兑换工作",
    "content": "为实现普通纪念币公开、公平、公正发行，2014年8月，人民银行布置四大国家银行业金融机构开展预约兑换普通纪念币方式。要求商业银行合理确定辖区兑换网点和每个网点兑换数量，并以适当方式向社会公布；加强对省级钱币学会向会员兑换普通纪念币管理，指导省级钱币学会制订向会员兑换普通纪念币管理办法，改进和加强普通纪念币兑换管理工作。"
  }, {
    "title": "2015年，发行2015年版第五套人民币100元纸币",
    "content": "中国人民银行2015年7月31日发布2015年第23号公告，定于2015年11月12日起发行2015年版第五套人民币100元纸币，与同面额流通人民币等值流通。2015年版第五套人民币100元纸币对部分图案做了适当调整，对整体防伪性能进行了提升，有利于加强人民币反假工作。"
  }, {
    "title": "2016年，中国人民银行数字货币研究所正式成立",
    "content": "2016年6月8日，经中央编办批准(中央编办复字(2016)77号)，中国人民银行印制科学技术研究所正式更名为中国人民银行数字货币研究所，业务范围是:数字货币研究与开发、原型设计与构建、试验与推广、系统建设与运维。"
  }, {
    "title": "2017年，印发《货币金银从业人员职业行为准则》",
    "content": "为规范货币金银从业人员职业行为，提高货币金银从业人员整体素质和职业水准，强化公私分明、崇廉拒腐意识，中国人民银行货币金银局制定了《货币金银从业人员职业行为准则》，共十二条，于2017年5月2日印发。"
  }, {
    "title": "2017年，发布《不宜流通人民币纸币》行业标准。",
    "content": "2017年5月25日，人民银行发布《不宜流通人民币纸币》行业标准（JR/T 0153-2017），规定了不宜流通人民币纸币的类别及判定标准，适用于办理人民币存取款业务及整点业务的金融机构。"
  }, {
    "title": "2017年，发布《人民币现金机具鉴别能力技术规范》行业标准",
    "content": "2017年7月，人民银行发布《人民币现金机具鉴别能力技术规范》行业标准，标准规定了人民币现金机具鉴别能力的技术要求、测试方法和检验规则，标准适用于具有人民币真假鉴别能力的现金机具。标准自2018年1月1日起实施。"
  }, {
    "title": "2017年，组织开展非标准金银清点查验工作",
    "content": "为加强人民银行非标准金银管理，发掘和保护金银文物，防范风险，总行决定从2017年9月起组织开展非标准金银清点查验工作，从过去偏重金银数量管理向数量与文物管理并重转变，推动金银管理转型发展，弘扬金银历史文化这是全面提升金银管理水平的一项基础性工作。"
  }, {
    "title": "2017年，具有数字货币特征的电子支付工作（DC/EP）研究项目正式启动",
    "content": "2017年11月7日，国务院正式批准人民银行组织开展DC/EP研究。11月22日，人民银行正式启动DC/EP研究项目，组建研发工作组，办公室设在货币金银局。"
  }, {
    "title": "2017年，启动中国货币史研究",
    "content": "为揭示货币发行、管理客观规律，以史为鉴、古为今用，2017年11月，启动中国货币史研究工作，搭建平台，动员力量，创新思维，充分运用现代货币金融方法开展研究。"
  }, {
    "title": "2018年，成都分行积极探索印制企业承接钞票处理业务",
    "content": "2018年1月3日，成都分行将人民银行钞票处理职能正式移交至成都印钞有限公司。该项机制转变提升了钞票处理业务管理效率和风险管控水平，确保了钞票处理业务安全高效运行。"
  }
];

let initDB = () => {
  checkList.map(({
    title
  }, vote_id) => `insert into cbpm_vote_list(sid,vote_id,vote_name,vote_nums) values(2,${vote_id},'${title}',0);`).join('\n');
}

export default checkList.map((item, id) => Object.assign(item, {
  id
}));
